<!--1. Инкапсуляция позволяет нам объединить  данные и методы, работающие с ними, в классах и скрыть детали реализации от пользователей.-->
<!---->
<!--2.  +-->
<!--        Возможность расширения-->
<!--        Код локализирован, менеьше вероятность ошибок-->
<!--        Составление сложных объектов из простых-->
<!--        Возможно в совокупности требует меньше времени на разработку-->
<!---->
<!--    --->
<!--        Проектирование классов-->
<!--        Наследование-->

<?
public class Car
{


}

?>
